# MepCoolingCoilType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepCoolingCoilType Property
ParameterTypeId Class See Also
---
"Cooling Coil"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepCoolingCoilType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepCoolingCoilType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepCoolingCoilType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace